src/Reports/СводныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>СводныйОтчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СписокРазделов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивСмен</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/СводныйОтчет/Forms/ФормаНастройки/module.bsl
Процедура ОсновныеДействияФормыЗакрыть(Кнопка)
	//ЗагрузитьНастройки(СтруктураНастроекПриОткрытии);
	//
	//Отмена = Истина;
	Закрыть();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыДействие(Кнопка)
	
	Если Не ЗначениеЗаполнено(МестоРеализации) Тогда
		Сообщить("Не заполнено место реализации!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	Закрыть();
	
	СформироватьОтчет(ВладелецФормы.ЭлементыФормы.Результат);
	
КонецПроцедуры
 
Процедура КнопкаДатаНажатие(Элемент)
	ФормированиеОтчетов.КнопкаПериодНажатие(ЭтотОбъект);
КонецПроцедуры

Процедура КнопкаСменыНажатие(Элемент) 
	ФормированиеОтчетов.КнопкаСменаНажатие(ЭтотОбъект);
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ПредставлениеПериода(ДатаС,ДатаПо);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивСмен) Тогда
		МестоРеализации = МассивСмен[0].Значение.МестоРеализации;
	Иначе
		МестоРеализации = ?(ЗначениеЗаполнено(МестоРеализации),МестоРеализации,Константы.ОсновноеМестоРеализации.Получить());
	КонецЕсли;
	
	ЭлементыФормы.МестоРеализации.Доступность = Не ЗначениеЗаполнено(МассивСмен);
		
КонецПроцедуры
